uhnp/src/DataProcessors/ВыборСпособовПокрытияПотребностиВФинансировании/ВыборСпособовПокрытияПотребностиВФинансировании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыборСпособовПокрытияПотребностиВФинансировании</name>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/РегистрСостоянийОбъектов/РегистрСостоянийОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрСостоянийОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеОбъекта</name>
    <type>
      <types>EnumRef.СостоянияИнцидентов</types>
      <types>EnumRef.СостоянияСогласования</types>
      <types>EnumRef.СтатусыВыгружаемыхОбъектовЕИС</types>
      <types>EnumRef.СостоянияДоговоров</types>
      <types>EnumRef.СостоянияТранзакций</types>
      <types>EnumRef.СостоянияМероприятий</types>
      <types>EnumRef.СостоянияПроектов</types>
      <types>CatalogRef.СостоянияСогласования</types>
      <types>EnumRef.СостоянияОтчетов</types>
      <types>EnumRef.СтатусыЛотов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/КредитныеЛимиты/КредитныеЛимиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КредитныеЛимиты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лимит</name>
    <type>
      <types>DocumentRef.КредитныйЛимит</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ВерсииГрафиковРасчетов/ВерсииГрафиковРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииГрафиковРасчетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОпорныйГрафик</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/ЛимитыРамочныхДоговоровКредитовЗаймов/ЛимитыРамочныхДоговоровКредитовЗаймов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЛимитыРамочныхДоговоровКредитовЗаймов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаЛимита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнениеГрафик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнениеФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РамочныйДоговор</name>
    <type>
      <types>DefinedType.ДоговорКредитаДепозита</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транш</name>
    <type>
      <types>DefinedType.Транш</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/ЗначенияКотировокФИ/ЗначенияКотировокФИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияКотировокФИ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>DefinedType.ТипЗначениеКотировки</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>DefinedType.ТипЗначениеКотировки</types>
    </type>
  </resources>
  <attributes>
    <name>КолонкаКотировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидКотировки</name>
    <type>
      <types>DefinedType.ИсточникКотировки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидЛотовойЗакупки/ВидЛотовойЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидЛотовойЗакупки</name>
  <enumValues>
    <name>ЛотоваяЗакупка</name>
  </enumValues>
  <enumValues>
    <name>ПопозиционнаяЗакупка</name>
  </enumValues>
  <enumValues>
    <name>Зонтичная</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/МетодыОценкиПредложенийПоставщиков/МетодыОценкиПредложенийПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыОценкиПредложенийПоставщиков</name>
  <enumValues>
    <name>ПоЦенам</name>
  </enumValues>
  <enumValues>
    <name>ПоКритериям</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНаОплате</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОплачено</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеактивен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/ВыборСпособовПокрытияПотребностиВФинансировании/Forms/ФормаОбработки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗаявки(); 
	ЗаполнитьСпособыПокрытия();
	ИспользоватьУправлениеЗакупками 	= Истина;
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Модифицированность И НЕ ВыполняетсяЗакрытие Тогда
			
			Отказ = Истина;
			
			ТекстВопроса = НСтр("ru = 'Все несохраненные результаты выбора будут потеряны. Все равно закрыть?'");
			ОписаниеОповещенияПослеВопросаПриЗакрытииФормы = Новый ОписаниеОповещения("ПослеВопросаПриЗакрытииФормы", ЭтотОбъект);
			
			ПоказатьВопрос(ОписаниеОповещенияПослеВопросаПриЗакрытииФормы, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	УправлениеФормой();	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

 #Область ОбработчикиСобытийЭлементовТаблицыЗаявки
&НаКлиенте
Процедура ЗаявкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Ссылка);

КонецПроцедуры                                  
        
#КонецОбласти  

 #Область ОбработчикиСобытийЭлементовТаблицыЗаявкиДетализация
                                
&НаКлиенте
Процедура ЗаявкиДетализацияПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.ЗаявкиДетализация.ТекущиеДанные;
	ТекущиеДанные.НомерСтроки 	= 0;
	ТекущиеДанные.Выбран 		= Ложь;
	
	Отказ = Истина;
	ЗаполнитьЗаявлено();

КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиДетализацияОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Для каждого МассивЭлемент Из ПараметрыПеретаскивания.Значение Цикл
		
		МассивЭлемент.Выбран 		= Ложь;
		МассивЭлемент.НомерСтроки 	= 0;		
	
	КонецЦикла;         
	ЗаполнитьЗаявлено();

КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиДетализацияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,Элементы.ЗаявкиДетализация.ТекущиеДанные.Ссылка);
КонецПроцедуры

#КонецОбласти

 #Область ОбработчикиСобытийЭлементовТаблицыСпособыПокрытия
&НаКлиенте
Процедура СпособыПокрытияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыПокрытияПередНачаломИзменения(Элемент, Отказ)
	
	Если НЕ Элемент.ТекущиеДанные.ЭтоЗакупки Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыПокрытияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СпособыПокрытияСтрока =  СпособыПокрытия.НайтиПоИдентификатору(Строка);
	
	НомерСтроки 				= СпособыПокрытияСтрока.НомерСтроки;   
	ВидФинансированияПокрытия  	= СпособыПокрытияСтрока.ВидФинансирования; 
	ПроцентныйПериодНачальный	= СпособыПокрытияСтрока.ПроцентныйПериод; 
	СтрокиПеретаскивания 		= ПараметрыПеретаскивания.Значение;   
	
	ВидФинансированияНеСовпадает 	= Ложь; 
	ПроцентныйПериодНеСовпадает		= Ложь;
	Для каждого СтрокаПеретаскивания Из СтрокиПеретаскивания Цикл
		Если НЕ ЗначениеЗаполнено(СпособыПокрытияСтрока.ПроцентныйПериод) Тогда
           СпособыПокрытияСтрока.ПроцентныйПериод = СтрокаПеретаскивания.ПроцентныйПериод;
		ИначеЕсли СпособыПокрытияСтрока.ПроцентныйПериод <> СтрокаПеретаскивания.ПроцентныйПериод Тогда
		   ПроцентныйПериодНеСовпадает = Истина;	
		КонецЕсли;
		Если СтрокаПеретаскивания.ВидФинансирования <> ВидФинансированияПокрытия Тогда
			ВидФинансированияНеСовпадает = Истина;
		КонецЕсли;
	КонецЦикла;
			
	УстановитьСпособыПокрытия(НомерСтроки, СтрокиПеретаскивания, СпособыПокрытияСтрока);
	
КонецПроцедуры 

&НаКлиенте
Процедура СпособыПокрытияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		НомерСтрокиСпособаПокрытия = 0;	 
		Возврат;
	КонецЕсли;                        
	НомерСтрокиСпособаПокрытия 	=  ТекущиеДанные.НомерСтроки; 
	СуммаЗаявлено				=  ТекущиеДанные.Заявлено; 
	
	НовыйОтборСтрок = Новый ФиксированнаяСтруктура("Валюта,НомерСтроки",ОтборВалюта, НомерСтрокиСпособаПокрытия);
	Элементы.ЗаявкиДетализация.ОтборСтрок 			= НовыйОтборСтрок;
 	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьДокументы(Команда) 
	СтруктураПроверки = ПроверитьСпособыПокрытия();
	
	Если СтруктураПроверки.Превышение Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Превышены суммы свободного остатка источников финансирования'"),,"СпособыПокрытия");
		Возврат;	
	КонецЕсли;
	
	Если СтруктураПроверки.Нарушен Тогда 
		ТекстВопроса 	= НСтр("ru = 'Виды финансирования не совпадают. Заменить вид финансирования в заявке?'");
		Обработчик 		= Новый ОписаниеОповещения("ВидыФинансированияЗавершить", ЭтотОбъект);
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет)   	
	Иначе 
		СоздатьДокументыПродолжение();
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Процедура СоздатьДокументыПродолжение()
	
	Модифицированность = Ложь; 
	СозданныеДокументы.Очистить();
	КоличествоДокументовПокрытия = СоздатьДокументыПокрытия(); 
	
	Если ЕстьДокументыЗакупки() Тогда
		ОповещениеПараметров = Новый ОписаниеОповещения("СоздатьДокументыПокрытияПродолжение",ЭтотОбъект);
	    ОткрытьФорму("Обработка.ВыборСпособовПокрытияПотребностиВФинансировании.Форма.ФормаПараметровЗакупок", 
						Новый Структура("Организация",ОрганизацияЗаказчик),
						ЭтотОбъект,,,,ОповещениеПараметров, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе	
		ЗавершитьСозданиеДокументов();
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Процедура ВидыФинансированияЗавершить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьНовыйВидФинансирования();			
	КонецЕсли; 

	СоздатьДокументыПродолжение();
	
КонецПроцедуры   

&НаКлиенте
Процедура СоздатьДокументыПокрытияПродолжение(Результат, ДополнительныеПараметры) Экспорт
	Если  Результат = Неопределено Тогда
		Возврат;	  
	КонецЕсли;
	
	КоличествоДокументовЗакупок = СоздатьДокументыЗакупки(Результат); 
	
	ЗавершитьСозданиеДокументов();
	
КонецПроцедуры

 &НаСервере
Функция СоздатьДокументыПокрытия()
	
	ЧтоСоздано = 0;
	Для каждого СтрокаСпособа  Из СпособыПокрытия Цикл
		
		Если СтрокаСпособа.ЭтоЗакупки	И ИспользоватьУправлениеЗакупками Тогда
			Продолжить;		
		КонецЕсли;
		НомерСтроки = СтрокаСпособа.НомерСтроки;
		
		ДокументыЗаявки = Заявки.НайтиСтроки(Новый Структура("НомерСтроки", НомерСтроки));	
		
		Если НЕ ДокументыЗаявки.Количество() Тогда
			Продолжить;	
		КонецЕсли;     
		
		ДокументПокрытия = Документы.ПокрытиеПотребностиВФинансировании.СоздатьДокумент();
		ДокументПокрытия.Дата = ТекущаяДатаСеанса();
		ЗаполнитьЗначенияСвойств(ДокументПокрытия, СтрокаСпособа);
		ДокументПокрытия.ВалютаДокумента	= ОтборВалюта;
		
		ОбщаяСумма = 0;
		СтатьяДвиженияДенежныхСредствОсновнойДолг 	= Неопределено; 
		СтатьяДвиженияДенежныхСредствПроценты 		= Неопределено;
		ДатаПривлечения = Неопределено;
		ДатаВозврата	= Неопределено;

		СтруктураРеквизитовЗаявки = СтруктураРеквизитовЗаявки();
		Для Каждого ДокументЗаявка ИЗ ДокументыЗаявки Цикл 
			Если ДатаПривлечения = Неопределено Тогда
				ДатаПривлечения = ДокументЗаявка.ДатаПривлечения;
			Иначе
				ДатаПривлечения = Мин(ДокументЗаявка.ДатаПривлечения, ДатаПривлечения);				
			КонецЕсли;   
			
			Если ДатаВозврата = Неопределено Тогда
				ДатаВозврата = ДокументЗаявка.ДатаВозврата;
			Иначе
				ДатаВозврата = Мин(ДокументЗаявка.ДатаВозврата, ДатаВозврата);				
			КонецЕсли;
       		
		    СтруктураРеквизитовЗаявки.СтатьяДвиженияДенежныхСредствОсновнойДолг = ДокументЗаявка.СтатьяДвиженияДенежныхСредствОсновнойДолг;
			СтруктураРеквизитовЗаявки.СтатьяДвиженияДенежныхСредствПроценты		= ДокументЗаявка.СтатьяДвиженияДенежныхСредствПроценты; 
			СтруктураРеквизитовЗаявки.ОсновнаяСтатьяИсполнение					= ДокументЗаявка.ОсновнаяСтатьяИсполнение; 
			СтруктураРеквизитовЗаявки.СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат					= ДокументЗаявка.СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат;
			СтруктураРеквизитовЗаявки.ЦФО = ДокументЗаявка.ЦФО;
			СтруктураРеквизитовЗаявки.Проект = ДокументЗаявка.Проект;
			Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
				СтруктураРеквизитовЗаявки["АналитикаОсновногоДолга"+Сч]= ДокументЗаявка["АналитикаОсновнойДолг"+Сч];
				СтруктураРеквизитовЗаявки["АналитикаОсновнойДолгВозврат"+Сч]= ДокументЗаявка["АналитикаОсновнойДолгВозврат"+Сч];
				СтруктураРеквизитовЗаявки["Аналитика"+Сч]= ДокументЗаявка["АналитикаПроценты"+Сч];
				СтруктураРеквизитовЗаявки["АналитикаИсполнение"+Сч]= ДокументЗаявка["АналитикаИсполнение"+Сч];
			КонецЦикла;
          		
			СтрокаЗНПФ = ДокументПокрытия.ЗаявкиНаПривлечениеФинансирования.Добавить();	
			СтрокаЗНПФ.Заявка = ДокументЗаявка.Ссылка;
			ОбщаяСумма = ОбщаяСумма + ДокументЗаявка.Сумма; 
			ДокументПокрытия.ЦФО 	= ДокументЗаявка.ЦФО;
			ДокументПокрытия.Проект = ДокументЗаявка.Проект;	
		КонецЦикла;    
		ДокументПокрытия.ДатаНачалаДействия 	= ДатаПривлечения;
		ДокументПокрытия.ДатаОкончанияДействия	= ДатаВозврата;
		ДокументПокрытия.СуммаДокумента 		= ОбщаяСумма;
		ДокументПокрытия.Записать();
		
		ДокументПокрытия.ОсновнойВариантФинансирования = СоздатьВариантФинансирования(ДокументПокрытия.Ссылка, 
															СтрокаСпособа, 
															ОбщаяСумма, 
															СтруктураРеквизитовЗаявки,
															ДатаПривлечения,
															ДатаВозврата);
		
		ДокументПокрытия.Записать(РежимЗаписиДокумента.Проведение);
		
		НовыйСозданныйДокумент = СозданныеДокументы.Добавить();
		НовыйСозданныйДокумент.Документ = ДокументПокрытия.Ссылка;		
		ЧтоСоздано = ЧтоСоздано + 1;
	КонецЦикла; 
	
	Возврат ЧтоСоздано;
КонецФункции

&НаСервере
Функция СоздатьДокументыЗакупки(СтруктураПараметров)
	
	ЧтоСоздано = 0;
	
	Если НЕ ИспользоватьУправлениеЗакупками Тогда
		Возврат ЧтоСоздано;
	КонецЕсли;	
	
	Для каждого СтрокаСпособа  Из СпособыПокрытия Цикл
		
		Если НЕ СтрокаСпособа.ЭтоЗакупки Тогда
			Продолжить;		
		КонецЕсли;  

		Если НЕ СтрокаСпособа.КИспользованию Тогда
			Продолжить;		
		КонецЕсли;

		НомерСтроки = СтрокаСпособа.НомерСтроки;
		
		ДокументыЗаявки = Заявки.НайтиСтроки(Новый Структура("НомерСтроки", НомерСтроки));	
		
		Если НЕ ДокументыЗаявки.Количество() Тогда
			Продолжить;	
		КонецЕсли;   
			
		ЗакупочнаяПроцедура = Справочники.ЗакупочныеПроцедуры.СоздатьЭлемент();
		
		ЗакупочнаяПроцедура.ВалютаДокумента 			= ОтборВалюта;
		ЗакупочнаяПроцедура.ПриобретениеФинансовыхУслуг = Истина;
		ЗакупочнаяПроцедура.ПериодЗакупок				= СтруктураПараметров.ПериодЗакупок;
		ЗакупочнаяПроцедура.ОрганизаторЗакупки			= СтруктураПараметров.ОрганизацияЗаказчик;
		ЗакупочнаяПроцедура.ОрганизацияДляЗаключенияДоговора	= СтруктураПараметров.ОрганизацияЗаказчик;
		ЗакупочнаяПроцедура.СпособВыбораПоставщика		= СтруктураПараметров.СпособВыбораПоставщика;
		ЗакупочнаяПроцедура.ЗакрытаяЗакупка 			= СтруктураПараметров.СпособВыбораПоставщика.ЗакрытыйСпособ;
		ЗакупочнаяПроцедура.ВЭлектроннойФорме 			= СтруктураПараметров.СпособВыбораПоставщика.ЭлектроннаяФорма;
		ЗакупочнаяПроцедура.ДатаОфициальногоОбъявленияЗакупки = СтруктураПараметров.ДатаОфициальногоОбъявленияЗакупки;  
		ЗакупочнаяПроцедура.ДатаНачалаПодготовкиЗакупки	= Макс(ЗакупочнаяПроцедура.ДатаОфициальногоОбъявленияЗакупки, ТекущаяДатаСеанса());  
		ЗакупочнаяПроцедура.КоличествоМестСОбязанностьюЗаключитьДоговор = 2;
		
		ЗакупочнаяПроцедура.Наименование				= "Приобретение финансовых услуг";
		ЗакупочнаяПроцедура.ПриобретениеФинансовыхУслуг = Истина;
		ЗакупочнаяПроцедура.ПредметДоговора				= "< Уточните предмет договора >"; 
		ЗакупочнаяПроцедура.ОбщиеТребования				= "< Уточните предмет договора >";
		ЗакупочнаяПроцедура.МинимальноеКоличествоЗаявок = 2;
			
		ЗакупочнаяПроцедура.Записать();
				
		НовыйСозданныйДокумент = СозданныеДокументы.Добавить();
		НовыйСозданныйДокумент.Документ = ЗакупочнаяПроцедура.Ссылка;	
		
		ДокументЛот 		= Документы.Лот.СоздатьДокумент();
		ДокументЛот.Дата 	= ТекущаяДатаСеанса();
		ЗаполнитьЗначенияСвойств(ДокументЛот, СтрокаСпособа);
        ДокументЛот.ЗакупочнаяПроцедура 		= ЗакупочнаяПроцедура.Ссылка; 
		ДокументЛот.ПриобретениеФинансовыхУслуг	= Истина; 
		ДокументЛот.ВидЗакупки					= Перечисления.ВидЛотовойЗакупки.ЛотоваяЗакупка;
		ДокументЛот.ВалютаДокумента						= ОтборВалюта;  
		ДокументЛот.ПериодЗакупок						= СтруктураПараметров.ПериодЗакупок; 
		ДокументЛот.ОрганизацияДляЗаключенияДоговора	= СтруктураПараметров.ОрганизацияЗаказчик;
   		ДокументЛот.МетодОценкиПредложенийПоставщиков 	= Перечисления.МетодыОценкиПредложенийПоставщиков.ПоКритериям;
		ДокументЛот.ЗапретПревышенияНМЦ					= Истина;      
		ДокументЛот.ПредметДоговора				= "< Уточните предмет договора >"; 
		ДокументЛот.ОбщиеТребования				= "< Уточните предмет договора >";
		
		ОбщаяСумма = 0;
		ОбщаяСуммаПроцентов = 0; 
		
		ДатаПривлечения 	= Неопределено;
		ДатаВозврата		= Неопределено; 
		ПроцентнаяСтавка	= Неопределено;
		Для Каждого ДокументЗаявка ИЗ ДокументыЗаявки Цикл 
			Если ДатаПривлечения = Неопределено Тогда
				ДатаПривлечения =  ДокументЗаявка.ДатаПривлечения;                 		
			Иначе 
				ДатаПривлечения = Мин(ДатаПривлечения,ДокументЗаявка.ДатаПривлечения);
			КонецЕсли;	
			
			Если ПроцентнаяСтавка = Неопределено Тогда
				ПроцентнаяСтавка =  ДокументЗаявка.ПроцентнаяСтавка;                 		
			Иначе 
				ПроцентнаяСтавка = Мин(ПроцентнаяСтавка,ДокументЗаявка.ПроцентнаяСтавка);
			КонецЕсли;	
			
			Если ДатаВозврата = Неопределено Тогда
				ДатаВозврата =  ДокументЗаявка.ДатаВозврата;                 		
			Иначе 
				ДатаВозврата = Макс(ДатаВозврата, ДокументЗаявка.ДатаВозврата);
			КонецЕсли;	
			
			СтрокаЗНПФ = ДокументЛот.ЗаявкиНаПривлечениеФинансирования.Добавить();	
			СтрокаЗНПФ.Заявка = ДокументЗаявка.Ссылка; 
			ЗаполнитьЗначенияСвойств(СтрокаЗНПФ, ДокументЗаявка.Ссылка);
			ЗаполнитьЗначенияСвойств(СтрокаЗНПФ, ДокументЗаявка);
			ОбщаяСумма = ОбщаяСумма + ДокументЗаявка.Сумма; 
			ОбщаяСуммаПроцентов = ОбщаяСуммаПроцентов + ДокументЗаявка.СуммаПроцентов; 			
			ДокументЛот.ПроцентныйПериод 	= ДокументЗаявка.ПроцентныйПериод;
		КонецЦикла;
		ДокументЛот.ДатаПривлечения    	= ДатаПривлечения;
		ДокументЛОт.ДатаВозврата	    = ДатаВозврата;
		ДокументЛот.СуммаПривлечения 	= ОбщаяСумма; 
		СуммаПроцентов					= ОбщаяСуммаПроцентов;
		ДокументЛот.ПроцентнаяСтавка	= ПроцентнаяСтавка;
			
		Документы.Лот.РассчитатьСуммуПроцентов(ДокументЛот);
		ДокументЛот.Записать(РежимЗаписиДокумента.Проведение); 
		
		
		ЧтоСоздано = ЧтоСоздано + 1;
		
	КонецЦикла;
	
	Возврат ЧтоСоздано;

КонецФункции

&НаКлиенте
Процедура ОтменитьВыбор(Команда)

	Для каждого СтрокаСпособа  Из СпособыПокрытия Цикл
		СтрокаСпособа.Заявлено  = 0;
		СтрокаСпособа.ОстатокПослеОперации  = 0;  
	КонецЦикла;  
	
	Для каждого СтрокаЗаявка Из Заявки Цикл
		СтрокаЗаявка.НомерСтроки 	= 0;
		СтрокаЗаявка.Выбран 		= Ложь;
    КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСозданныхДокументов(Команда)
	МассивДокументов = Новый Массив;
	Для каждого СтрокаСозданныеДокументы Из СозданныеДокументы Цикл
		МассивДокументов.Добавить(СтрокаСозданныеДокументы.Документ);
	КонецЦикла;
	СтруктураПараметров = Новый Структура("МассивДокументов",  МассивДокументов);
	ОткрытьФорму("Обработка.ВыборСпособовПокрытияПотребностиВФинансировании.Форма.РезультатыСоздания",
					СтруктураПараметров, ЭтотОбъект,,,, ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьЗаявки(); 
	ЗаполнитьСпособыПокрытия();
	Элементы.ЗаявкиДетализация.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьЗаявки()
	
	Заявки.Очистить();
	ТаблицаВалюты.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкаНПФ.Ссылка КАК Ссылка,
		|	ЗаявкаНПФ.Номер КАК Номер,
		|	ЗаявкаНПФ.Дата КАК Дата,
		|	ЗаявкаНПФ.Организация КАК Организация,
		|	ЗаявкаНПФ.ВидФинансирования КАК ВидФинансирования,
		|	ЗаявкаНПФ.СуммаПроцентов КАК СуммаПроцентов,
		|	ЗаявкаНПФ.СуммаЗаимствования КАК Сумма,
		|	ЗаявкаНПФ.ВалютаДокумента КАК Валюта,
		|	ЗаявкаНПФ.Аналитика1 КАК АналитикаПроценты1,
		|	ЗаявкаНПФ.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредствПроценты,
		|	ЗаявкаНПФ.СтатьяДвиженияДенежныхСредствОсновнойДолг КАК СтатьяДвиженияДенежныхСредствОсновнойДолг,
		|	ЗаявкаНПФ.Аналитика2 КАК АналитикаПроценты2,
		|	ЗаявкаНПФ.Аналитика3 КАК АналитикаПроценты3,
		|	ЗаявкаНПФ.Аналитика4 КАК АналитикаПроценты4,
		|	ЗаявкаНПФ.Аналитика5 КАК АналитикаПроценты5,
		|	ЗаявкаНПФ.Аналитика6 КАК АналитикаПроценты6,
		|	ЗаявкаНПФ.АналитикаОсновнойДолг1 КАК АналитикаОсновнойДолг1,
		|	ЗаявкаНПФ.АналитикаОсновнойДолг2 КАК АналитикаОсновнойДолг2,
		|	ЗаявкаНПФ.АналитикаОсновнойДолг3 КАК АналитикаОсновнойДолг3,
		|	ЗаявкаНПФ.АналитикаОсновнойДолг5 КАК АналитикаОсновнойДолг5,
		|	ЗаявкаНПФ.АналитикаОсновнойДолг6 КАК АналитикаОсновнойДолг6,
		|	ЗаявкаНПФ.ПериодичностьНачисленияПроцентов КАК ПроцентныйПериод,
		|	ЗаявкаНПФ.ДатаПривлечения КАК ДатаПривлечения,
		|	ЗаявкаНПФ.ДатаВозврата КАК ДатаВозврата,
		|	ЗаявкаНПФ.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
		|	ЗаявкаНПФ.Проект КАК Проект,
		|	ЗаявкаНПФ.ЦФО КАК ЦФО,
		|	ЗаявкаНПФ.ОсновнаяСтатьяИсполнение КАК ОсновнаяСтатьяИсполнение,
		|	ЗаявкаНПФ.АналитикаИсполнение1 КАК АналитикаИсполнение1,
		|	ЗаявкаНПФ.АналитикаИсполнение2 КАК АналитикаИсполнение2,
		|	ЗаявкаНПФ.АналитикаИсполнение3 КАК АналитикаИсполнение3,
		|	ЗаявкаНПФ.АналитикаИсполнение4 КАК АналитикаИсполнение4,
		|	ЗаявкаНПФ.АналитикаИсполнение5 КАК АналитикаИсполнение5,
		|	ЗаявкаНПФ.АналитикаИсполнение6 КАК АналитикаИсполнение6,
		|	ЗаявкаНПФ.СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат КАК СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат,
		|	ЗаявкаНПФ.АналитикаОсновнойДолгВозврат1 КАК АналитикаОсновнойДолгВозврат1,
		|	ЗаявкаНПФ.АналитикаОсновнойДолгВозврат2 КАК АналитикаОсновнойДолгВозврат2,
		|	ЗаявкаНПФ.АналитикаОсновнойДолгВозврат3 КАК АналитикаОсновнойДолгВозврат3,
		|	ЗаявкаНПФ.АналитикаОсновнойДолгВозврат4 КАК АналитикаОсновнойДолгВозврат4,
		|	ЗаявкаНПФ.АналитикаОсновнойДолгВозврат5 КАК АналитикаОсновнойДолгВозврат5,
		|	ЗаявкаНПФ.АналитикаОсновнойДолгВозврат6 КАК АналитикаОсновнойДолгВозврат6
		|ИЗ
		|	Документ.ЗаявкаНаПривлечениеФинансирования КАК ЗаявкаНПФ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектов
		|		ПО ЗаявкаНПФ.Ссылка = РегистрСостоянийОбъектов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПокрытиеПотребностиВФинансировании.ЗаявкиНаПривлечениеФинансирования КАК ПокрытиеПотребности
		|		ПО ЗаявкаНПФ.Ссылка = ПокрытиеПотребности.Заявка
		|			И (ПокрытиеПотребности.Ссылка.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лот.ЗаявкиНаПривлечениеФинансирования КАК ЛотыЗаявки
		|		ПО (ЛотыЗаявки.Заявка = ЗаявкаНПФ.Ссылка)
		|			И (ЛотыЗаявки.Ссылка.Проведен)
		|ГДЕ
		|	РегистрСостоянийОбъектов.СостояниеОбъекта = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Утверждена)
		|	И ПокрытиеПотребности.Ссылка ЕСТЬ NULL
		|	И ЛотыЗаявки.Ссылка ЕСТЬ NULL
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка)
		|ПО
		|	Валюта";
	
	РезультатЗапроса 	= Запрос.Выполнить();
	ВыборкаВалюты 		= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВалюты.Следующий() Цикл 
		
		СтрокаВалюты = ТаблицаВалюты.Добавить();
		СтрокаВалюты.Валюта 	= ВыборкаВалюты.Валюта;
		СтрокаВалюты.Количество = ВыборкаВалюты.Ссылка;
		
		ВыборкаДетальныеЗаписи = ВыборкаВалюты.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаЗаявки = 	Заявки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗаявки, ВыборкаДетальныеЗаписи);
		КонецЦикла;

	КонецЦикла;
	
	Элементы.Валюта.СписокВыбора.Очистить();  
	Для каждого СтрокаТаблица Из ТаблицаВалюты Цикл
		СтрокаПредставление = СтрШаблон(Нстр("ru = '%1 (%2)'"), СтрокаТаблица.Валюта, СтрокаТаблица.Количество);
		Элементы.Валюта.СписокВыбора.Добавить(СтрокаТаблица.Валюта, СтрокаПредставление);
	КонецЦикла;
	
	Если Элементы.Валюта.СписокВыбора.Количество() Тогда 
		ОтборВалюта = Элементы.Валюта.СписокВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УправлениеФормой(ОбновлятьСпособыПокрытия = Истина)
	
	// Заявки 
	Если ЗначениеЗаполнено(ОтборВалюта)  Тогда
    	НовыйОтборСтрок = Новый ФиксированнаяСтруктура("Валюта,Выбран",ОтборВалюта,Ложь);
		Элементы.Заявки.ОтборСтрок 			= НовыйОтборСтрок; 
	Иначе
		Элементы.Заявки.ОтборСтрок = Новый ФиксированнаяСтруктура()	;	
	КонецЕсли;  
	
	ТаблицаКИсполнению = Заявки.Выгрузить(Новый Структура("Валюта",ОтборВалюта));
	
	Элементы.КИсполнению.Заголовок = СтрШаблон(НСтр("ru='К исполнению: %1 %2'"), ТаблицаКИсполнению.Итог("Сумма"),ОтборВалюта);

	Если НЕ ОбновлятьСпособыПокрытия Тогда 
		Возврат;
	КонецЕсли;
	
	// Способы покрытия	
	Если ЗначениеЗаполнено(ОтборОрганизация) И ЗначениеЗаполнено(ОтборВалюта) Тогда
  		НовыйОтборСтрок = Новый ФиксированнаяСтруктура("Организация,Валюта", ОтборОрганизация, ОтборВалюта);
		Элементы.СпособыПокрытия.ОтборСтрок = НовыйОтборСтрок;                     
	ИначеЕсли ЗначениеЗаполнено(ОтборОрганизация) Тогда	
		НовыйОтборСтрок = Новый ФиксированнаяСтруктура("Организация", ОтборОрганизация );
		Элементы.СпособыПокрытия.ОтборСтрок = НовыйОтборСтрок;  	
	ИначеЕсли ЗначениеЗаполнено(ОтборВалюта) Тогда	
		НовыйОтборСтрок = Новый ФиксированнаяСтруктура("Валюта",  ОтборВалюта);
		Элементы.СпособыПокрытия.ОтборСтрок = НовыйОтборСтрок;  		
	Иначе
		Элементы.СпособыПокрытия.ОтборСтрок = Новый ФиксированнаяСтруктура();	
	КонецЕсли;   
	
	КоличествоСозданныхДокументов = СозданныеДокументы.Количество(); 
	Элементы.СписокСозданныхДокументов.Видимость = КоличествоСозданныхДокументов;
	Если КоличествоСозданныхДокументов Тогда
		Элементы.СписокСозданныхДокументов.Заголовок = СтрШаблон(НСтр("ru='Созданные документы (%1)'"), КоличествоСозданныхДокументов)
	Иначе
		Элементы.СписокСозданныхДокументов.Заголовок = НСтр("ru='Созданные документы'")	
	КонецЕсли;
	
Конецпроцедуры	

&НаСервере
Процедура ЗаполнитьСпособыПокрытия()
	
	СпособыПокрытия.Очистить();

	НомерСтроки 			= СпособыПокрытия.Количество() + 1; 
	Для каждого СтрокаТаблица Из ТаблицаВалюты Цикл
		СтрокаСпособыПокрытия = СпособыПокрытия.Добавить();
		СтрокаСпособыПокрытия.ВидФинансирования 	= Перечисления.ВидыФинансирования.НовыйКредит;
		СтрокаСпособыПокрытия.НомерСтроки 			= НомерСтроки;
		СтрокаСпособыПокрытия.Валюта                = СтрокаТаблица.Валюта;
		НомерСтроки 								= НомерСтроки + 1; 
		СтрокаСпособыПокрытия.ЭтоЗакупки			= Истина;
	КонецЦикла;
   	ЗаполнитьКредитныеЛимиты();
	ЗаполнитьВГЗРамочныеДоговора(); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКредитныеЛимиты()

	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК ПредметГрафика,
		|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
		|	ДоговорыКонтрагентов.ВидФинансовогоИнструмента КАК ВидФинансовогоИнструмента,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.СуммаТраншей КАК СуммаДоговора,
		|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаФинансовогоИнструмента
		|ПОМЕСТИТЬ втДоговоры
		|ИЗ
		|	Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.ВидСоглашения = ЗНАЧЕНИЕ(Перечисление.ВидыСоглашений.РамочныйДоговор)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КредитныеЛимитыСрезПоследних.Контрагент КАК Контрагент,
		|	КредитныеЛимитыСрезПоследних.Лимит КАК КредитныйЛимит,
		|	КредитныйЛимитОрганизации.Организация КАК Организация,
		|	КредитныеЛимитыСрезПоследних.Регистратор.ВалютаДокумента КАК ВалютаЛимита,
		|	КредитныеЛимитыСрезПоследних.Регистратор.СуммаЛимита КАК СуммаЛимита,
		|	КредитныеЛимитыСрезПоследних.Регистратор.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		|ПОМЕСТИТЬ втЛимиты
		|ИЗ
		|	РегистрСведений.КредитныеЛимиты.СрезПоследних(&Период, ) КАК КредитныеЛимитыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КредитныйЛимит.Организации КАК КредитныйЛимитОрганизации
		|		ПО КредитныеЛимитыСрезПоследних.Регистратор = КредитныйЛимитОрганизации.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КредитныйЛимит.ВидыФинансовыхИнструментов КАК КредитныйЛимитВидыФинансовыхИнструментов
		|		ПО КредитныеЛимитыСрезПоследних.Регистратор = КредитныйЛимитВидыФинансовыхИнструментов.Ссылка
		|			И (КредитныйЛимитВидыФинансовыхИнструментов.ВидФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.КредитПолученный))
		|ГДЕ
		|	КредитныеЛимитыСрезПоследних.Использовать
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	т.Валюта КАК Валюта,
		|	т.Курс КАК Курс,
		|	т.Кратность КАК Кратность
		|ПОМЕСТИТЬ втКурсы
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(
		|			,
		|			Валюта В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					втЛимиты.ВалютаЛимита
		|				ИЗ
		|					втЛимиты КАК втЛимиты)) КАК т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	втЛимиты.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(втЛимиты.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
		|	втЛимиты.ВалютаЛимита КАК ВалютаЛимита,
		|	втЛимиты.КредитныйЛимит КАК КредитныйЛимит,
		|	втЛимиты.СуммаЛимита КАК СуммаЛимита,
		|	втЛимиты.СуммаЛимита - СУММА(ВЫБОР
		|			КОГДА втЛимиты.ВалютаЛимита = втДоговоры.ВалютаФинансовогоИнструмента
		|				ТОГДА ЕСТЬNULL(втДоговоры.СуммаДоговора, 0)
		|			КОГДА ЕСТЬNULL(втКурсыОД.Кратность, 0) = 0
		|					ИЛИ ЕСТЬNULL(втКурсыЛимита.Курс, 0) = 0
		|				ТОГДА ЕСТЬNULL(втДоговоры.СуммаДоговора, 0)
		|			ИНАЧЕ ЕСТЬNULL(втДоговоры.СуммаДоговора, 0) * втКурсыОД.Курс * втКурсыЛимита.Кратность / втКурсыОД.Кратность / втКурсыЛимита.Курс
		|		КОНЕЦ) КАК СуммаДоговораВВалютеЛимита,
		|	СУММА(втДоговоры.СуммаДоговора) КАК СуммаДоговора,
		|	втЛимиты.КредитныйЛимит.ДатаНачала КАК ДатаНачалаДействияЛимита,
		|	втЛимиты.КредитныйЛимит.ДатаОкончания КАК ДатаОкончанияДействияЛимита,
		|	втЛимиты.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		|ПОМЕСТИТЬ втСоединение
		|ИЗ
		|	втЛимиты КАК втЛимиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДоговоры КАК втДоговоры
		|		ПО втЛимиты.Контрагент = втДоговоры.Контрагент
		|			И (ВЫБОР
		|				КОГДА втЛимиты.Организация ЕСТЬ NULL
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ втЛимиты.Организация = втДоговоры.Организация
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсы КАК втКурсыЛимита
		|		ПО (втЛимиты.ВалютаЛимита <> втДоговоры.ВалютаФинансовогоИнструмента)
		|			И втЛимиты.ВалютаЛимита = втКурсыЛимита.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсы КАК втКурсыОД
		|		ПО (втЛимиты.ВалютаЛимита <> втДоговоры.ВалютаФинансовогоИнструмента)
		|			И (втДоговоры.ВалютаФинансовогоИнструмента = втКурсыОД.Валюта)
		|
		|СГРУППИРОВАТЬ ПО
		|	втЛимиты.Контрагент,
		|	втЛимиты.ВалютаЛимита,
		|	втЛимиты.КредитныйЛимит,
		|	втЛимиты.СуммаЛимита,
		|	втЛимиты.КредитныйЛимит.ДатаНачала,
		|	втЛимиты.КредитныйЛимит.ДатаОкончания,
		|	втЛимиты.ПроцентнаяСтавка,
		|	ЕСТЬNULL(втЛимиты.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Организации.Ссылка) КАК КоличествоОрганизаций
		|ПОМЕСТИТЬ ВТ_Организации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСоединение.Контрагент КАК Контрагент,
		|	втСоединение.Организация КАК Организация,
		|	втСоединение.ВалютаЛимита КАК Валюта,
		|	втСоединение.КредитныйЛимит КАК Договор,
		|	втСоединение.СуммаЛимита КАК СуммаЛимита,
		|	втСоединение.ДатаНачалаДействияЛимита КАК ДатаНачалаДействия,
		|	втСоединение.ДатаОкончанияДействияЛимита КАК ДатаОкончанияДействия,
		|	втСоединение.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
		|	втСоединение.СуммаДоговораВВалютеЛимита КАК СвободныйОстаток
		|ИЗ
		|	втСоединение КАК втСоединение
		|ГДЕ
		|	втСоединение.СуммаДоговораВВалютеЛимита > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	втСоединение.Контрагент,
		|	втСоединение.Организация,
		|	втСоединение.ВалютаЛимита,
		|	втСоединение.КредитныйЛимит,
		|	втСоединение.СуммаЛимита,
		|	втСоединение.ДатаНачалаДействияЛимита,
		|	втСоединение.ДатаОкончанияДействияЛимита,
		|	втСоединение.ПроцентнаяСтавка,
		|	втСоединение.СуммаДоговораВВалютеЛимита
		|ИЗ
		|	втСоединение КАК втСоединение,
		|	ВТ_Организации КАК ВТ_Организации
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТ_Организации.КоличествоОрганизаций = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ втСоединение.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|		КОНЕЦ
		|	И втСоединение.СуммаДоговораВВалютеЛимита > 0";

	Запрос.УстановитьПараметр("Период", 						ТекущаяДатаСеанса());
	РезультатЗапроса 	= Запрос.Выполнить();
	НомерСтроки 		= СпособыПокрытия.Количество() + 1;

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТаблицаВариантов 				= СпособыПокрытия.Добавить();
		СтрокаТаблицаВариантов.НомерСтроки 	= НомерСтроки;
		НомерСтроки 						= НомерСтроки + 1;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицаВариантов, ВыборкаДетальныеЗаписи);
		СтрокаТаблицаВариантов.ТипПроцентнойСтавки 		= Перечисления.ТипыСтавокДляРасчетаПериодическихОпераций.Фиксированная;
		СтрокаТаблицаВариантов.ПроцентнаяСтавкаСтрока 	= Строка(ВыборкаДетальныеЗаписи.ПроцентнаяСтавка) + " %";	
		СтрокаТаблицаВариантов.ВидФинансирования		= Перечисления.ВидыФинансирования.НовыйКредит;
	КонецЦикла;


КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВГЗРамочныеДоговора()
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 
		"ВЫБРАТЬ
		|	ВерсииГрафиковРасчетовСрезПоследних.ПредметГрафика КАК Договор,
		|	ЕСТЬNULL(ВерсииГрафиковРасчетовСрезПоследних.Регистратор.ДатаНачалаДоступности, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаДоступности,
		|	ЕСТЬNULL(ВерсииГрафиковРасчетовСрезПоследних.Регистратор.ДатаОкончанияДоступности, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияДоступности,
		|	ЕСТЬNULL(ВерсииГрафиковРасчетовСрезПоследних.Регистратор.ДатаНачалаДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаДействия,
		|	ЕСТЬNULL(ВерсииГрафиковРасчетовСрезПоследних.Регистратор.ДатаОкончанияДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияДействия,
		|	ЕСТЬNULL(ВерсииГрафиковРасчетовСрезПоследних.Регистратор.Сумма, 0) КАК ОбщийЛимит,
		|	ЕСТЬNULL(ВерсииГрафиковРасчетовСрезПоследних.Регистратор.ВозобновляемыйЛимит, ЛОЖЬ) КАК ВозобновляемыйЛимит,
		|	ВерсииГрафиковРасчетовСрезПоследних.Организация КАК Организация,
		|	ВерсииГрафиковРасчетовСрезПоследних.ПредметГрафика.ВалютаВзаиморасчетов КАК Валюта
		|ПОМЕСТИТЬ ВТПараметры
		|ИЗ
		|	РегистрСведений.ВерсииГрафиковРасчетов.СрезПоследних(&ДатаОтбора, ) КАК ВерсииГрафиковРасчетовСрезПоследних
		|ГДЕ
		|	ВерсииГрафиковРасчетовСрезПоследних.ПредметГрафика.ВидДоговораУХ В(&ВидДоговораУХ)
		|	И ВерсииГрафиковРасчетовСрезПоследних.ПредметГрафика.ВидСоглашения = ЗНАЧЕНИЕ(Перечисление.ВидыСоглашений.РамочныйДоговор)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛимитыРамочныхДоговоров.РамочныйДоговор КАК БазовыйДоговор,
		|	ЛимитыРамочныхДоговоров.СуммаЛимитаОборот КАК СуммаЛимита,
		|	ЛимитыРамочныхДоговоров.ИсполнениеГрафикОборот КАК ИтогоРасход
		|ПОМЕСТИТЬ ВТИсполнение
		|ИЗ
		|	РегистрНакопления.ЛимитыРамочныхДоговоровКредитовЗаймов.Обороты(
		|			,
		|			&ДатаОтбора,
		|			,
		|			РамочныйДоговор В
		|				(ВЫБРАТЬ
		|					ВТПараметры.Договор
		|				ИЗ
		|					ВТПараметры)) КАК ЛимитыРамочныхДоговоров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПараметры.Организация КАК Организация,
		|	ВТПараметры.Договор КАК Договор,
		|	ВТПараметры.Договор.ВерсияСоглашения.ТипПроцентнойСтавки КАК ТипПроцентнойСтавки,
		|	ЕСТЬNULL(ВТПараметры.Договор.ВерсияСоглашения.ПроцентнаяСтавка, 0) КАК ПроцентнаяСтавка,
		|	ЕСТЬNULL(ВТПараметры.Договор.ВерсияСоглашения.РучноеУправлениеИзменениямиСтавки, ЛОЖЬ) КАК РучноеУправлениеИзменениямиСтавки,
		|	ЕСТЬNULL(ВТПараметры.Договор.ВерсияСоглашения.ИндикативнаяСтавка, НЕОПРЕДЕЛЕНО) КАК ИндикативнаяСтавка,
		|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВТПараметры.Договор.ВерсияСоглашения.ИндикативнаяСтавка, НЕОПРЕДЕЛЕНО)) КАК ИндикативнаяСтавкаПредставление,
		|	ЕСТЬNULL(ВТПараметры.Договор.ВерсияСоглашения.ПлавающаяСтавкаМаксимум, 0) КАК ПлавающаяСтавкаМаксимум,
		|	ЕСТЬNULL(ВТПараметры.Договор.ВерсияСоглашения.ПлавающаяСтавкаМинимум, 0) КАК ПлавающаяСтавкаМинимум,
		|	ЕСТЬNULL(ВТПараметры.Договор.ВерсияСоглашения.ДатаОтсчетаПроцентныхПериодов, НЕОПРЕДЕЛЕНО) КАК ДатаОтсчетаПроцентныхПериодов,
		|	ЕСТЬNULL(ВТПараметры.Договор.ВерсияСоглашения.ДатаОкончанияПервогоПроцентногоПериода, НЕОПРЕДЕЛЕНО) КАК ДатаОкончанияПервогоПроцентногоПериода,
		|	ЕСТЬNULL(ВТПараметры.Договор.ВерсияСоглашения.ПериодичностьУплатыПроцентов, НЕОПРЕДЕЛЕНО) КАК ПериодичностьУплатыПроцентов,
		|	ЕСТЬNULL(ВТПараметры.Договор.ВерсияСоглашения.ВыплачиватьПроцентыПериодически, ЛОЖЬ) КАК ВыплачиватьПроцентыПериодически,
		|	ВТПараметры.ДатаНачалаДоступности КАК ДатаНачалаДоступности,
		|	ВТПараметры.ДатаОкончанияДоступности КАК ДатаОкончанияДоступности,
		|	ВТПараметры.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ВТПараметры.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ВТПараметры.ОбщийЛимит КАК ОбщийЛимит,
		|	ВТПараметры.ВозобновляемыйЛимит КАК ВозобновляемыйЛимит,
		|	ЕСТЬNULL(ВТИсполнение.ИтогоРасход, 0) КАК ИтогоРасход,
		|	ВЫБОР
		|		КОГДА ВТПараметры.ВозобновляемыйЛимит
		|			ТОГДА ЕСТЬNULL(ВТИсполнение.СуммаЛимита, 0)
		|		ИНАЧЕ ВТПараметры.ОбщийЛимит - ЕСТЬNULL(ВТИсполнение.ИтогоРасход, 0)
		|	КОНЕЦ КАК СвободныйОстаток,
		|	ВТПараметры.Договор.Контрагент КАК Контрагент,   
		|	ВТПараметры.Договор.Контрагент.ОрганизационнаяЕдиница КАК ОрганизационнаяЕдиница,
		|	ВТПараметры.Валюта КАК Валюта
		|ИЗ
		|	ВТПараметры КАК ВТПараметры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсполнение КАК ВТИсполнение
		|		ПО ВТПараметры.Договор = ВТИсполнение.БазовыйДоговор
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТПараметры.ВозобновляемыйЛимит
		|				ТОГДА ЕСТЬNULL(ВТИсполнение.СуммаЛимита, 0)
		|			ИНАЧЕ ВТПараметры.ОбщийЛимит - ЕСТЬNULL(ВТИсполнение.ИтогоРасход, 0)
		|		КОНЕЦ > 0";
	
	Запрос.УстановитьПараметр("ДатаОтбора", 			ТекущаяДатаСеанса());
	МассивВидовДоговоров = Новый Массив;
	МассивВидовДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.Кредит);
	МассивВидовДоговоров.Добавить(Справочники.ВидыДоговоровКонтрагентовУХ.ЗаемПолученный);
	Запрос.УстановитьПараметр("ВидДоговораУХ", 			МассивВидовДоговоров);
	РезультатЗапроса 		= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	
	НомерСтроки 	= СпособыПокрытия.Количество() + 1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаТаблицаВариантов = СпособыПокрытия.Добавить();
		СтрокаТаблицаВариантов.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицаВариантов, ВыборкаДетальныеЗаписи);
		Если  ВыборкаДетальныеЗаписи.ПроцентнаяСтавка <> 0 Тогда  
			ДопПроцент = 0;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИндикативнаяСтавка) Тогда
				ДопПроцент = РегистрыСведений.ЗначенияКотировокФИ.ПолучитьКотировку(ВыборкаДетальныеЗаписи.ИндикативнаяСтавка);		
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИндикативнаяСтавка)
				И	ВыборкаДетальныеЗаписи.ТипПроцентнойСтавки <> Перечисления.ТипыСтавокДляРасчетаПериодическихОпераций.Фиксированная Тогда
			ПроцентнаяСтавкаСтрока = СтрШаблон(НСтр("ru='%1 + %2 %3'"), ВыборкаДетальныеЗаписи.ИндикативнаяСтавкаПредставление, ВыборкаДетальныеЗаписи.ПроцентнаяСтавка,"%");
			СтрокаТаблицаВариантов.ПроцентнаяСтавкаСтрока = ПроцентнаяСтавкаСтрока;
		Иначе
			СтрокаТаблицаВариантов.ПроцентнаяСтавкаСтрока = Строка(ВыборкаДетальныеЗаписи.ПроцентнаяСтавка) + " %";			
		КонецЕсли;

		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОрганизационнаяЕдиница) Тогда
			СтрокаТаблицаВариантов.ВидФинансирования = Перечисления.ВидыФинансирования.ТраншВнутригрупповогоЗайма;
		Иначе
			СтрокаТаблицаВариантов.ВидФинансирования = Перечисления.ВидыФинансирования.ТраншКредитнойЛинии;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьВариантФинансирования(ДокументПокрытия, СтрокаПокрытия, Сумма, СтруктураРеквизитовЗаявки,
										ДатаНачалаДействия, ДатаОкончанияДействия)

		НовыйВариант = Справочники.ВариантыФинансирования.СоздатьЭлемент();
		НовыйВариант.ПокрытиеПотребностиВФинансировании	= ДокументПокрытия;
		НовыйВариант.ТипПроцентнойСтавки    			= СтрокаПокрытия.ТипПроцентнойСтавки;
		Если НЕ ЗначениеЗаполнено(НовыйВариант.ТипПроцентнойСтавки) Тогда
			НовыйВариант.ТипПроцентнойСтавки = Перечисления.ТипыСтавокДляРасчетаПериодическихОпераций.Фиксированная;	
		КонецЕсли;                                                                                                  
		НовыйВариант.ПроцентнаяСтавка					= СтрокаПокрытия.ПроцентнаяСтавка;
		НовыйВариант.РучноеУправлениеИзменениямиСтавки	= СтрокаПокрытия.РучноеУправлениеИзменениямиСтавки;
		НовыйВариант.Организация						= СтрокаПокрытия.Организация;
		НовыйВариант.ОбщаяСумма							= Сумма;
		НовыйВариант.ИндикативнаяСтавка					= СтрокаПокрытия.ИндикативнаяСтавка;      
		НовыйВариант.ПлавающаяСтавкаМинимум				= СтрокаПокрытия.ПлавающаяСтавкаМинимум;     
		НовыйВариант.ПлавающаяСтавкаМаксимум			= СтрокаПокрытия.ПлавающаяСтавкаМаксимум;    
		НовыйВариант.ДатаОкончанияПервогоПроцентногоПериода	= СтрокаПокрытия.ДатаОкончанияПервогоПроцентногоПериода;     
		НовыйВариант.ДатаОтсчетаПроцентныхПериодов		= СтрокаПокрытия.ДатаОтсчетаПроцентныхПериодов;    
		НовыйВариант.ПериодичностьУплатыПроцентов		= СтрокаПокрытия.ПериодичностьУплатыПроцентов; 
		НовыйВариант.ВыплачиватьПроцентыПериодически	= СтрокаПокрытия.ВыплачиватьПроцентыПериодически;
		НовыйВариант.БазаДляРасчетаПроцентов			= Справочники.СпособыРасчетаДнейПериодическихОпераций.ГодФактМесяцФакт;
		НовыйВариант.ВидДнейСдвигаУплаты 				= Перечисления.СпособыРасчетаКоличестваДнейВПериоде.ПоКалендарнымДням;
		НовыйВариант.ТочкаОтсчетаДатыФиксацииСтавки   	= Перечисления.СпособыОпределенияДатыОперацииПоПериоду.НачалоПериода;
		НовыйВариант.НачислениеПроцентовНаКрайниеДаты	= Перечисления.СпособыНачисленияПроцентовНаГраницыПериодов.НачислятьПроцентыНаПоследнийДень;
		НовыйВариант.ДатаНачалаДействия					= ДатаНачалаДействия; 
		НовыйВариант.ДатаОкончанияДействия				= ДатаОкончанияДействия; 
		НовыйВариант.Контрагент							= СтрокаПокрытия.Контрагент; 
		НовыйВариант.Договор                            = СтрокаПокрытия.Договор;  
		НовыйВариант.ВалютаДокумента					= СтрокаПокрытия.Валюта;
		НовыйВариант.ВидФинансирования					= СтрокаПокрытия.ВидФинансирования;

		Если ТипЗнч(СтрокаПокрытия.Договор) = Тип("ДокументСсылка.КредитныйЛимит") Тогда
			Наименование								= СтрШаблон(НСтр("ru='%1 %2'"),
															Строка(СтрокаПокрытия.Контрагент),
															Строка(НовыйВариант.ВидФинансирования));
		ИначеЕсли ТипЗнч(СтрокаПокрытия.Договор) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда  
			ЗначенияРеквизитовДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаПокрытия.Договор, "ВидДоговораУХ, Наименование");
			Наименование								= СтрШаблон(НСтр("ru='%1 %2 %3'"),
															Строка(СтрокаПокрытия.Контрагент),
															Строка(СтрокаПокрытия.ВидФинансирования),
															ЗначенияРеквизитовДоговора.Наименование);
		КонецЕсли;
		НовыйВариант.Наименование						= Наименование;
		РаботаСДоговорамиКонтрагентовУХ.ЗаполнитьПроизводственныеКалендариПоУмолчанию(НовыйВариант.ПроизводственныеКалендари);
		
		СтрокаПрихода 						= НовыйВариант.ГрафикРасчетов.Добавить();
		СтрокаПрихода.ВидБюджета			= ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств;
		СтрокаПрихода.НаправлениеДвижения 	= Перечисления.ВидыДвиженийПриходРасход.Приход;
		СтрокаПрихода.Дата					= ДатаНачалаДействия;
		СтрокаПрихода.ОперацияГрафика		= Справочники.ОперацииГрафиковДоговоров.КредитПолученный_ОсновнойДолгПолучение;
		СтрокаПрихода.Сумма					= Сумма;
		СтрокаПрихода.Валюта				= СтрокаПокрытия.Валюта;
		СтрокаПрихода.ЭлементСтруктурыЗадолженности	= Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг;
		СтрокаПрихода.ВидОперацииУХ			= Справочники.ВидыОперацийУХ.ПоступленияПоКредитамИЗаймам;
		СтрокаПрихода.КолонкаСекции			= Перечисления.ВидыДвиженийПриходРасход.Приход;
		СтрокаПрихода.СтатьяБюджета			= СтруктураРеквизитовЗаявки.СтатьяДвиженияДенежныхСредствОсновнойДолг;
		Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
			СтрокаПрихода["Аналитика" + Сч] = СтруктураРеквизитовЗаявки["АналитикаОсновногоДолга" + Сч];
		КонецЦикла;	
		
		СтрокаРасхода 						= НовыйВариант.ГрафикРасчетов.Добавить();
		СтрокаРасхода.ВидБюджета			= ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств;
		СтрокаРасхода.НаправлениеДвижения 	= Перечисления.ВидыДвиженийПриходРасход.Расход;
		СтрокаРасхода.Дата					= ДатаОкончанияДействия;
		СтрокаРасхода.ОперацияГрафика		= Справочники.ОперацииГрафиковДоговоров.КредитПолученный_ОсновнойДолгВозврат;
		СтрокаРасхода.Сумма					= Сумма;
		СтрокаРасхода.Валюта				= СтрокаПокрытия.Валюта;
		СтрокаРасхода.ЭлементСтруктурыЗадолженности	= Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг;
		СтрокаРасхода.ВидОперацииУХ			= Справочники.ВидыОперацийУХ.ПлатежПоКредитуИлиЗайму;
		СтрокаРасхода.КолонкаСекции			= Перечисления.ВидыДвиженийПриходРасход.Расход; 
		СтрокаРасхода.СтатьяБюджета			= СтруктураРеквизитовЗаявки.СтатьяДвиженияДенежныхСредствОсновнойДолг;     
     	Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
			СтрокаРасхода["Аналитика" + Сч] = СтруктураРеквизитовЗаявки["АналитикаОсновногоДолга" + Сч];
		КонецЦикла;	
	
		РассчитатьСуммыПроцентовНаСервере(НовыйВариант,,СтруктураРеквизитовЗаявки);

		ГруппаОперацийГрафика = НовыйВариант.ГруппаОперацийГрафика();
		ТаблицаНастроек = РаботаСДоговорамиКонтрагентовУХ.ПараметрыОперацийГрафикаПоУмолчанию(ГруппаОперацийГрафика); 
		
		Для каждого СтрокаГрафик Из НовыйВариант.ГрафикРасчетов Цикл
			СтрокаГрафик.Валюта				= СтрокаПокрытия.Валюта; 
			СтрокаГрафик.ЦФО				= СтруктураРеквизитовЗаявки.ЦФО; 
			СтрокаГрафик.Проект				= СтруктураРеквизитовЗаявки.Проект; 

			ОтборОперацияГрафика 	= Новый Структура("ОперацияГрафика, ПриходРасход",
						 			СтрокаГрафик.ОперацияГрафика, СтрокаГрафик.НаправлениеДвижения);
			СтрокиОперацияГрафика	= ТаблицаНастроек.НайтиСтроки(ОтборОперацияГрафика);
      		Для каждого СтрокаОперацияГрафика Из СтрокиОперацияГрафика Цикл   
				ЗаполнитьЗначенияСвойств(СтрокаОперацияГрафика, СтрокаГрафик);	
			КонецЦикла; 	
			
		КонецЦикла; 
		НовыйВариант.ПараметрыОпераций.Загрузить(ТаблицаНастроек);
     	НовыйВариант.Записать();
     	
		Возврат НовыйВариант.Ссылка;

КонецФункции // ()

&НаСервере
Процедура РассчитатьСуммыПроцентовНаСервере(Объект, Отказ = Ложь, СтруктураРеквизитовЗаявки )
	
	Если Объект.ГрафикРасчетов.Итог("Сумма") = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеГрафика 	= Справочники.ВариантыФинансирования.ОписаниеГрафика();
	ПереченьОпераций 	= РаботаСДоговорамиКонтрагентовУХ.ОперацииГрафика(ОписаниеГрафика, Объект, Справочники.ВидыДоговоровКонтрагентовУХ.Кредит);
	ОперацииГрафика 	= Новый ФиксированноеСоответствие(ПереченьОпераций);
	СтруктураДействий 	= Новый Структура;
	Секции 				= Новый Массив;
	Если Не ФинансовыеИнструментыУХ.СтрокиСекцииГрафика(Объект.ГрафикРасчетов, ОписаниеГрафика["ОсновнойДолг"]).Количество() Тогда
		Секции.Добавить("ОсновнойДолг");
	КонецЕсли;
	Секции.Добавить("Проценты");
	
	СтруктураДействий.Вставить("Пересчитать", Новый Структура("СекцииГрафика", Секции));
	ФинансовыеИнструментыУХ.ПересчетГрафика(Объект, 0, ОписаниеГрафика, ОперацииГрафика, СтруктураДействий, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	АналитикиСтатейБюджетовУХ.ЗаполнитьРеквизитыАналитикВсехСтатей(ЭтотОбъект);
	
	ОтборПроцентов 	= Новый Структура("ЭлементСтруктурыЗадолженности, ОперацияГрафика",
						   Перечисления.ЭлементыСтруктурыЗадолженности.Проценты, Справочники.ОперацииГрафиковДоговоров.КредитПолученный_ПроцентыНачислено);
	СтрокиПроценты 	= Объект.ГрафикРасчетов.НайтиСтроки(ОтборПроцентов);
	ИтогПроценты 	= 0;
	Для каждого СтрокаПроценты Из СтрокиПроценты Цикл
		ИтогПроценты = ИтогПроценты + СтрокаПроценты.Сумма;
	КонецЦикла;  
	
	ОтборПроцентов 	= Новый Структура("ЭлементСтруктурыЗадолженности",
						   Перечисления.ЭлементыСтруктурыЗадолженности.Проценты);
	СтрокиПроценты 	= Объект.ГрафикРасчетов.НайтиСтроки(ОтборПроцентов);
	Для каждого СтрокаПроценты Из СтрокиПроценты Цикл
		Для каждого СтрокаПроценты Из СтрокиПроценты Цикл   
			Если  СтрокаПроценты.ВидБюджета = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств Тогда 
				СтрокаПроценты.СтатьяБюджета = СтруктураРеквизитовЗаявки.СтатьяДвиженияДенежныхСредствПроценты; 
				Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
					СтрокаПроценты["Аналитика" + Сч] = СтруктураРеквизитовЗаявки["Аналитика" + Сч];
				КонецЦикла;	                                                                                        
			Иначе 
				СтрокаПроценты.СтатьяБюджета = СтруктураРеквизитовЗаявки.ОсновнаяСтатьяИсполнение; 
				Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
					СтрокаПроценты["Аналитика" + Сч] = СтруктураРеквизитовЗаявки["АналитикаИсполнение" + Сч];
				КонецЦикла;		
			КонецЕсли;
		КонецЦикла;  
	КонецЦикла;
	
	ОтборВозвратаДолга 	= Новый Структура("ЭлементСтруктурыЗадолженности, НаправлениеДвижения",
						   Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг, Перечисления.ВидыДвиженийПриходРасход.Расход);
						   
	СтрокиВозвратаДолга 	= Объект.ГрафикРасчетов.НайтиСтроки(ОтборВозвратаДолга);
	Для каждого СтрокаВозвратаДолга Из СтрокиВозвратаДолга Цикл
	    СтрокаВозвратаДолга.СтатьяБюджета = СтруктураРеквизитовЗаявки.СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат; 
		Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
			СтрокаВозвратаДолга["Аналитика" + Сч] = СтруктураРеквизитовЗаявки["АналитикаОсновнойДолгВозврат" + Сч];
		КонецЦикла;	
	КонецЦикла;

	Объект.ОбщаяСуммаПроцентов = ИтогПроценты;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСпособыПокрытия(НомерСтроки, СтрокиПеретаскивания, СпособыПокрытияСтрока)

	Для каждого СтрокаЗаявки Из СтрокиПеретаскивания Цикл
		СтрокаЗаявки.НомерСтроки 	= НомерСтроки;
		СтрокаЗаявки.Выбран 		= Истина;		
	КонецЦикла;

	СпособыПокрытияСтрока.КИспользованию = Истина;
 
	ЗаполнитьЗаявлено(); 

	ТекущиеДанные = Элементы.СпособыПокрытия.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		СуммаЗаявлено				=  ТекущиеДанные.Заявлено; 	
	КонецЕсли;                        
	
	Модифицированность = Истина;

КонецПроцедуры 

&НаСервере
Процедура УстановитьВидФинансирования(МассивЗаявок, НовыйВидФинансирования)
	
	Для каждого СтрокаЗаявки Из МассивЗаявок Цикл   
		
		ЗаявкаОбъект = СтрокаЗаявки.ПолучитьОбъект();
		ЗаявкаОбъект.ВидФинансирования 	= НовыйВидФинансирования;
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаявлено()
	
	Для каждого СтрокаСпособа  Из СпособыПокрытия Цикл
		
		НомерСтроки 		= СтрокаСпособа.НомерСтроки;
		
		ДокументыЗаявки 	= Заявки.НайтиСтроки(Новый Структура("НомерСтроки", НомерСтроки));	
		
		ОбщаяСумма = 0;
		
		Для Каждого ДокументЗаявка ИЗ ДокументыЗаявки Цикл 
			ОбщаяСумма = ОбщаяСумма + ДокументЗаявка.Сумма; 
		КонецЦикла; 
		
		СтрокаСпособа.Заявлено  			= ОбщаяСумма;
		Если СтрокаСпособа.СвободныйОстаток = 0 Тогда
			СтрокаСпособа.ОстатокПослеОперации  = 0;  			
		Иначе
			СтрокаСпособа.ОстатокПослеОперации  = СтрокаСпособа.СвободныйОстаток - ОбщаяСумма;  	
		КонецЕсли;
		
		
	КонецЦикла;   
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьСпособ(Команда)
	
	СпособыПокрытияСтрока 		= Элементы.СпособыПокрытия.ТекущиеДанные;
	СпособыПокрытияСтрокаНомер 	= Элементы.СпособыПокрытия.ТекущаяСтрока;
	СтрокаПеретаскивания 		= Элементы.Заявки.ТекущиеДанные;

	Если СпособыПокрытияСтрока = Неопределено 
			ИЛИ СтрокаПеретаскивания = Неопределено Тогда
		Возврат;	             
	КонецЕсли;
	НомерСтроки 				= СпособыПокрытияСтрока.НомерСтроки;   
	ВидФинансированияПокрытия  	= СпособыПокрытияСтрока.ВидФинансирования; 
	ПроцентныйПериодНачальный	= СпособыПокрытияСтрока.ПроцентныйПериод;  
	СтрокиПеретаскивания 		= Новый Массив;
	СтрокиПеретаскивания.Добавить(СтрокаПеретаскивания);	
	
	ПроцентныйПериодНеСовпадает		= Ложь; 
	
	Если НЕ ЗначениеЗаполнено(СпособыПокрытияСтрока.ПроцентныйПериод) Тогда
           СпособыПокрытияСтрока.ПроцентныйПериод = СтрокаПеретаскивания.ПроцентныйПериод;
	ИначеЕсли СпособыПокрытияСтрока.ПроцентныйПериод <> СтрокаПеретаскивания.ПроцентныйПериод Тогда
		   ПроцентныйПериодНеСовпадает = Истина;	
	КонецЕсли;
	
	УстановитьСпособыПокрытия(НомерСтроки, СтрокиПеретаскивания, СпособыПокрытияСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаПриЗакрытииФормы(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПроверитьСпособыПокрытия()
      	
	СтрокиСпособыПокрытия = СпособыПокрытия.НайтиСтроки( Новый Структура("КИспользованию",Истина));
	
	Нарушено 	= Ложь;
	Превышение 	= Ложь;
	Для каждого СтрокаСпособыПокрытия Из СтрокиСпособыПокрытия Цикл

		Если СтрокаСпособыПокрытия.Заявлено		 = 0 Тогда
			Продолжить;		
		КонецЕсли;   
		
		Если СтрокаСпособыПокрытия.Заявлено > СтрокаСпособыПокрытия.СвободныйОстаток 
				И СтрокаСпособыПокрытия.СвободныйОстаток > 0 Тогда
			Превышение = Истина;		
		КонецЕсли;

		ОсновнойВид = СтрокаСпособыПокрытия.ВидФинансирования;
		НомерСтроки = СтрокаСпособыПокрытия.НомерСтроки;
		
		СтрокиЗаявки = Заявки.НайтиСтроки(Новый Структура("НомерСтроки", НомерСтроки));	
		
		Если НЕ СтрокиЗаявки.Количество() Тогда
			Продолжить;	
		КонецЕсли;     
		
		Для Каждого ДокументЗаявка ИЗ СтрокиЗаявки Цикл 
			Если ДокументЗаявка.ВидФинансирования <> ОсновнойВид Тогда 
            	Нарушено = Истина;	
			КонецЕсли;	
		КонецЦикла; 
		
	КонецЦикла;
	
	Возврат Новый Структура("Нарушен, Превышение",Нарушено, Превышение);
	
КонецФункции

&НаСервере
Процедура УстановитьНовыйВидФинансирования()
	
	СтрокиСпособыПокрытия = СпособыПокрытия.НайтиСтроки( Новый Структура("КИспользованию",Истина));
	

	Для каждого СтрокаСпособыПокрытия Из СтрокиСпособыПокрытия Цикл

		Если СтрокаСпособыПокрытия.Заявлено		 = 0 Тогда
			Продолжить;		
		КонецЕсли;
		ОсновнойВид = СтрокаСпособыПокрытия.ВидФинансирования;
		НомерСтроки = СтрокаСпособыПокрытия.НомерСтроки;
		
		СтрокиЗаявки = Заявки.НайтиСтроки(Новый Структура("НомерСтроки", НомерСтроки));	
		
		Если НЕ СтрокиЗаявки.Количество() Тогда
			Продолжить;	
		КонецЕсли;     
		
		МассивЗаявок =  Новый Массив;
		   
		Для Каждого ДокументЗаявка ИЗ СтрокиЗаявки Цикл 
			Если ДокументЗаявка.ВидФинансирования <> ОсновнойВид Тогда 
            	МассивЗаявок.Добавить(ДокументЗаявка.Ссылка); 
				ДокументЗаявка.ВидФинансирования 	= ОсновнойВид; 
			КонецЕсли;	
		КонецЦикла; 
		
		УстановитьВидФинансирования(МассивЗаявок, ОсновнойВид);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СозданныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,Элементы.СозданныеДокументы.ТекущиеДанные.Документ);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСозданиеДокументов()

	ЗаполнитьЗаявки(); 
	ЗаполнитьСпособыПокрытия();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьДокументыЗакупки()  
	
	Если НЕ ИспользоватьУправлениеЗакупками Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокиСпособыПокрытия = СпособыПокрытия.НайтиСтроки( Новый Структура("ЭтоЗакупки, КИспользованию", Истина, Истина));
	Если СтрокиСпособыПокрытия.Количество() Тогда
		
		НомерСтроки = СтрокиСпособыПокрытия[0].НомерСтроки;
		
		ДокументыЗаявки = Заявки.НайтиСтроки(Новый Структура("НомерСтроки", НомерСтроки));	
		
		Если ДокументыЗаявки.Количество() Тогда
			ОрганизацияЗаказчик = ДокументыЗаявки[0].Организация;
		КонецЕсли; 				
					
		Возврат Истина;
	Иначе	                   
		ОрганизацияЗаказчик = Неопределено;
		Возврат Ложь;
	КонецЕсли;	
			
КонецФункции

&НаКлиенте
Процедура СпособыПокрытияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СпособыПокрытияДоговор" 
		И  ЗначениеЗаполнено(Элемент.ТекущиеДанные.Договор) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Договор);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтруктураРеквизитовЗаявки()
	
	СписокРеквизитовЗаявки = 
		"СтатьяДвиженияДенежныхСредствОсновнойДолг,
		|СтатьяДвиженияДенежныхСредствОсновнойДолгВозврат,
		|ОсновнаяСтатьяИсполнение,
		|ЦФО,
		|Проект,
		|СтатьяДвиженияДенежныхСредствПроценты";
	Результат = Новый Структура(СписокРеквизитовЗаявки);
	
	Для Сч = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
		Результат.Вставить("АналитикаОсновногоДолга"+Сч);
		Результат.Вставить("Аналитика"+Сч);
		Результат.Вставить("АналитикаИсполнение"+Сч);
		Результат.Вставить("АналитикаОсновнойДолгВозврат"+Сч)
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
